#定义pay()函数，设置两个参数mount和code，分别用于接收支付的钱和密码。
#函数内，首先判断输入的密码是否正确（正确密码为"888888"）；如果密码正确，则判断账户余额（余额为233）是否足够支付，如果余额足够则计算支付后剩下的余额newMount，并格式化输出：“支付成功，您的余额还剩{newMount}”；若余额不足，则格式化输出：“该卡余额不足！”；如果密码错误，则格式化输出：“密码输入错误，请重新输入！”。
#最后分两次调用该函数：第一次传入参数234，"888888"第二次传入参数128，"888888"

def pay (mount,code):
    newMount = 0
    if code == "888888":
        if mount <= 233:
            newMount = 233 - mount
            print(f"支付成功，您的余额还剩{newMount}")
        else:
            print(f"该卡余额不足！")           
    else:
        print(f"密码输入错误，请重新输入！")
pay(234,"888888")
pay(128,"888888")

